Revit 2026 API

# PointLoadMomentVector Property

---

The moment vector applied to the point load, oriented according to OrientTo setting.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ MomentVector { get; set; }
```
```vb
Public Property MomentVector As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ MomentVector {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member MomentVector : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The default force unit is kN-m for metric, and kip-ft for imperial. Use UnitUtils class methods to convert value from or to internal units.

#### Reference

PointLoad Class

Autodesk.Revit.DB.Structure Namespace